{ "articles": [{
    "title": "As Obama Was Lying To America About Hillary Clinton’s Email Server, This Was Happening…",
    "author": "Streiff",
    "image": "http://www.redstate.com/uploads/2016/10/hillary-panic-email.jpg",
    "text": "Back in March 2015, as Hillary Clinton’s email scandal was in its early stages, CBS correspondent Bill Plante asked Obama when he first learned of her hillbilly hardware. We’ve already learned that this is not true. Not only did Obama know about her email address, he communicated with her using her private email. However, when Obama made this pronouncement to the public it seems to have caught the Clinton camp by surprise. You can nearly smell the panic. But the subtext here is Obama telling Clinton that he will do whatever it takes to protect her campaign. And James Comey’s investigation showed he meant what he said."
  }, {
    "title": "Obama’s Military: Lower Standards For Women Serving In Infantry",
    "author": "Stridentconservative",
    "image": "http://www.stridentconservative.com/wp-content/uploads/2016/10/Lower-standards-women-military.jpg",
    "text": "Phyllis Schlafly, the recently deceased constitutional lawyer, conservative activist, and founder of Eagle Forum once said of feminism: “The feminist movement is just not compatible with happiness. They are not for equality, they just want to kill everything masculine.” Based on recent events in Obama’s socially engineered military, it looks like Phyllis knew exactly what she was talking about. Obama has already succeeded with the implementation of a slew of pro-LGBT and anti-Christian measures for the armed forces, including: However, Obama isn’t called America’s gay feminist president for nothing. As the man who once stated that he felt that it was his responsibility to destroy “traditional” gender roles, Obama took his desire to fundamentally transform America to a whole new level by lifting the ban preventing women from serving in infantry units and special ops such as the Navy SEALs and the Green Beret. Back in 2013, former Secretary of Defense Leon Panetta announced this change with a promise that the qualifications for women to serve in these roles would not be reduced. Female troops had to meet existing criteria or be rejected. At the time of the announcement, Colonel Ellen Haring of the US Army Reserves–who had filed a lawsuit challenging the combat exclusion ban–agreed with Panetta’s commitment, saying that women should “compete at the standards as they exist(ed).” But apparently, Colonel Haring has changed her mind. In a textbook display of the entitlement attitude we’ve come to expect from the left, she is now demanding that the standards for serving in the infantry and special ops be lowered for women because they are too hard. In an opinion piece to the Marine Corps Times, Haring called Marine Corps infantry training “unrealistic,” and concluded her point by asking: “Where do they get these standards, who validated them, and who can actually meet them? Well Colonel, the answer is obviously men, and the reason is clear. Men and women, despite what you and your feminist comrades say to the contrary, are different. And thanks to the unknown number of men who met these tough standards, our military has been successful against our enemies for generations. The disaster that would result from lower standards would be irreparable, which is why social engineering has no place in the military. But that won’t stop Obama and the left from doing it anyway as they advance what is essentially a military version of Affirmative Action for women and LGBT individuals. And make no mistake, America will eventually pay the price. By the way, what do you think is going to happen the first time a transgendered woman who identifies as a man fails these standards? I think you know the answer."
  }, {
    "title": "Rand Paul Schools Bernie Sanders On His Logic About Government Spending",
    "author": "Brandon Morse",
    "image": "http://cdn.thedailybeast.com/content/dailybeast/articles/2015/04/09/why-does-the-nra-suddenly-hate-rand/jcr:content/image.crop.800.500.jpg/47619644.cached.jpg",
    "text": "Insanity has engulfed us during the election season, but at least there are still some shining examples of how to be a good representative of the people out there. And once again, this example comes from Rand Paul. A video has resurfaced of a 2015 debate about the Older Americans Act, which sets aside billions of dollars to provide for seniors. During a discussion about spending on our medical system, Rand Paul points out that spending billions to save money is not at all saving money. This, of course, was disagreed upon by Bernie Sanders, who said that spending this money saves money. He reasons that if an ounce of prevention is good, then billions of dollars of prevention must be better. The OAA isn’t up to snuff, and so like any government program that’s failing, it just needs more money. Sanders believes it’s the government’s duty to keep people healthy, and wished to throw $2 billion at an act that allows seniors to stay at home, instead of a nursing home. While this sounds like a noble thing, this opens up an avenue of abuse, and puts more burden on the taxpayers. Rand Paul pointed out the slippery slope they were on. “If we are saving money by the $2 billion dollars we spend, perhaps we should give you $20 billion,” said Paul. “Is there a limit? Where would we get to? How much money should we give you in order to save money? So if we spend federal money to save money, where is the limit? I think we could reach a point of absurdity.” Paul is correct. We create government programs designed to help, but like any government program, it’s never effective enough. At some point it will always want to expand its reach, and do more. It will always require more money, and we need to learn to problem solve without reaching the conclusion that we should just throw more money at it."
  }]
}
